app/controllers/public/users_controller.rb

SELECT  "photos".* FROM "photos" INNER JOIN "likes" ON "likes"."photo_id" = "photos"."id" GROUP BY "photo_id" ORDER BY count(likes.id) DESC LIMIT ?  [["LIMIT", 50]]
---
    def top

        # ランキング表示
        # photo_like_count = Photo.joins(:likes).group(:photo_id).count
        # photo_liked_ids = Hash[photo_like_count.sort_by{ |_, v| -v }].keys
        # @photos = Photo.where(id: photo_liked_ids)
        @photos = Photo.joins(:likes).group(:photo_id).order(Arel.sql('count(likes.id) DESC')).limit(50)